{
  "everyone in my family has killed someone - benjamin stevenson": "A sardonic man at a family reunion untangles a string of deaths while insisting every relative is a suspect.",
  "the housemaid - freida mcfadden": "A woman takes a live-in maid job with a wealthy family and discovers their secrets are more dangerous than her own.",
  "the locked door - freida mcfadden": "A surgeon’s quiet life unravels when a copycat killer forces her to confront her father’s dark legacy.",
  "the crash - freida mcfadden": "A traumatic accident pulls a woman into a maze of lies and buried crimes in her seemingly safe community.",
  "none of this is true - lisa jewell": "A popular podcaster meets her real-life double and gets drawn into a chilling, manipulative story.",
  "murder games - james patterson": "A ruthless killer turns investigations into a deadly contest as detectives race to stop the next move.",
  "you shouldn't have come here - jeneva rose": "A city woman’s Wyoming getaway turns sinister as isolation and suspicion mount around her host and the town.",
  "the last thing he told me - laura dave": "A woman searches for her missing husband while bonding with his guarded teenage daughter and uncovering hidden truths.",
  "love letters to a serial killer - tasha coryell": "A lonely woman begins corresponding with a killer and finds her fantasies and reality colliding dangerously.",
  "she's not sorry - mary kubiac": "A devoted nurse is pulled into a patient’s mystery and a crash that may not have been an accident.",
  "the only survivors - megan miranda": "Former survivors of a teen tragedy reunite at a remote resort and learn someone wants the past buried for good.",
  "daughter of mine - megan miranda": "A woman returns to her hometown and digs into long-buried secrets tied to her family and a past disappearance.",
  "the day he never came home - andrew deyoung": "After her husband vanishes, a woman pieces together the last day she saw him and the truths he hid.",
  "the one that got away with murder - trish lundy": "A teen survivor of a brutal attack suspects a classmate’s family and fights to expose the truth.",
  "one perfect couple - ruth ware": "A reality show on a remote island becomes a deadly survival game for a couple and their fellow contestants.",
  "crosshairs - james patterson and james o. born": "An elite detective faces a high-stakes conspiracy as a new threat targets the city from the shadows.",
  "expiration dates - rebecca serle": "A woman whose love life comes with predicted end dates meets someone who doesn’t fit the rules.",
  "the love of my afterlife - kirsty greenwood": "After a mistaken death, a woman gets a second chance at love—if she can find the right person in time.",
  "say you'll remember me - abby jimenez": "A chance romance forces two people to decide whether a one-night connection can outlast real-life obstacles.",
  "midnight library - matt haig": "A woman explores alternate versions of her life in a magical library between life and death.",
  "assistant to the villain (series) - hannah nicole maehrer": "A bright assistant joins the right-hand team of a notorious villain and discovers the job is anything but normal.",
  "the final girl support group - grady hendrix": "Survivors of horror‑movie‑like massacres form a support group, until a new killer targets them.",
  "the moonlight child - karen mcquestion": "A young girl returns after a year missing, and her mother senses something is terribly wrong.",
  "kill for me kill for you - steve cavanagh": "Two strangers agree to trade murders, only to find the plan spiraling out of control.",
  "that's not my name - megan lally": "A girl with no memory is claimed by a family, but another teen insists their loved one is still missing.",
  "notes on an execution - dayna kukafka": "A death-row inmate’s last hours reveal the lives he shattered and the women who knew him.",
  "the business trip - jessie garcia": "Two women on the same work trip disappear, and the truth behind their identities starts to surface.",
  "the institute - stephen king": "Gifted kids are abducted into a secret facility where their powers are exploited under brutal rules.",
  "never flinch - stephen king": "A determined investigator confronts a terrifying case that pushes her courage and instincts to the limit.",
  "look closer - david ellis": "A thriller of marriage, deception, and hidden motives as a couple’s secrets collide.",
  "twenty years later - charlie donlea": "A cold case resurfaces and threatens to upend a life built on a past conviction.",
  "the frozen river - ariel lawhon": "A midwife in 18th‑century Maine becomes entangled in a murder investigation and local power struggles.",
  "how to get filthy rich in rising asia - mohsin hamid": "A rags‑to‑riches tale told as a self‑help guide about ambition, love, and modern life.",
  "princess kills monsters - ry herman": "A princess trained to fight monsters must survive a deadly quest and her own growing power.",
  "11.22.63 - stephen king": "A teacher travels back in time to try to stop the JFK assassination, risking the fabric of history.",
  "keep it in the family - john mars": "A couple uncover decades‑old secrets hidden in their new home, with deadly consequences.",
  "love, mom - ilana xander": "A young woman confronts her mother’s secrets through a haunting letter and a tangled family past.",
  "dark matter - blake crouch": "A physicist is thrust into a multiverse where he must fight to return to his original life.",
  "kafka on the shore - haruki murakami": "A runaway teen and an elderly man with strange abilities are drawn together by fate and myth.",
  "piranesi - susanna clarke": "A solitary man lives in a vast, mysterious house of endless halls, until a discovery changes everything.",
  "invisible monsters - chuck palahniuk": "A disfigured model joins a chaotic friend on a dark, wild journey of identity and reinvention.",
  "the guest list - lucy foley": "A wedding on a remote island turns deadly as old grudges surface and a guest is murdered.",
  "a history of wild places - shea ernshaw": "A private investigator searches for a missing author in a secluded community hiding unsettling secrets.",
  "the lies i tell - julie clark": "A con artist and the woman she once deceived enter a high‑stakes game of revenge.",
  "upgrade - blake crouch": "A man is forcibly upgraded with genetic enhancements and hunted as he uncovers the program behind it.",
  "daisy darker - alice feeney": "A family reunion in a remote house becomes a deadly countdown as relatives die one by one.",
  "under the dome - stephen king": "A small town is suddenly sealed under an invisible dome, and order collapses quickly.",
  "the shining - stephen king": "A family caretakes a remote hotel where a father is consumed by a terrifying supernatural force.",
  "play nice - rachel harrison": "A seemingly perfect family is tested when a child’s behavior reveals something far darker.",
  "the perfect marriage - jeneva rose": "A defense attorney’s husband is accused of murder, and a web of secrets threatens to ruin them both.",
  "broken country - clare leslie hall": "A woman returns to her rural roots and faces the cost of long-buried secrets in a divided community.",
  "ankle snatcher - grady hendrix": "A short, creepy tale where a child’s urban legend becomes horrifyingly real.",
  "don't let her stay - nicola sanders": "A woman lets someone into her life, only to realize the guest may be a dangerous impostor.",
  "pretty girls - karin slaughter": "Two sisters reunite after years apart to uncover the dark truth behind their family’s tragedy.",
  "our wives under the sea - julia armfield": "A marine biologist returns from a deep‑sea mission changed, and her wife grapples with the slow unraveling.",
  "one hundred years of solitude - gabriel garcia marquez": "A multigenerational saga of the Buendía family in the magical town of Macondo.",
  "the push - ashley audrain": "A mother questions her daughter’s darkness and her own sanity as motherhood becomes a haunting trial.",
  "east of eden - john steinbeck": "An epic family drama of rivalry and redemption set in California’s Salinas Valley.",
  "the island of last things - emma sloley": "Survivors on a ruined island search for hope as their world’s last resources fade.",
  "the girl i was - jeneva rose": "A woman confronts her past self after a disappearance pulls her back into old secrets.",
  "stoner - john williams": "A quiet professor’s life unfolds with understated tragedy, love, and endurance.",
  "strange houses - uketsu": "A journalist investigates eerie, shifting houses tied to disturbing disappearances.",
  "the ghostwriter - julie clark": "A writer digs into a famous author’s past and uncovers a mystery that won’t stay buried.",
  "the song of achilles - madeline miller": "A lyrical retelling of Achilles and Patroclus and the love that shapes their fate.",
  "tomorrow, and tomorrow, and tomorrow - gabrielle zevin": "Two friends build a video‑game career while navigating ambition, love, and loss.",
  "the feast of the goat - mario vargas llosa": "A tense portrait of dictatorship and its aftermath in the Dominican Republic.",
  "survivor - chuck palaniuck": "A notorious last survivor of a cult is thrust into celebrity and manipulation.",
  "jailbird - kurt vonnegut": "An ex‑con reflects on his life and the absurdities of politics and power.",
  "norweigan wood - haruki murakami": "A young man in 1960s Tokyo navigates love, loss, and memory.",
  "the three-body problem - liu cixin": "First contact with an alien civilization sets off a chain of scientific and political upheaval.",
  "the nickel boys - colston whitehead": "Two Black boys in a brutal reform school endure injustice in Jim Crow Florida.",
  "blood meridian - cormac mccarthy": "A violent, philosophical western follows a teen who rides with a brutal scalp‑hunting gang.",
  "lost city radio - daniel alarcon": "A radio host in a post‑war country helps families search for the disappeared and confronts her own past.",
  "childhood's end - arthur c clarke": "Humanity is shepherded by mysterious aliens toward a transformative—and unsettling—future.",
  "jade city - fonda lee": "Rival clans battle for control of magic jade in a gritty, Asian‑inspired city.",
  "project hail mary - andy weir": "A lone astronaut wakes with amnesia on a mission to save Earth and must solve a cosmic mystery.",
  "between the world and me - ta-nehisi coates": "A father writes a powerful letter to his son about race, identity, and America.",
  "i, medusa - ayana gray": "A mythic reimagining of Medusa told in verse, exploring power, rage, and survival.",
  "storm front - jim butcher": "Wizard‑detective Harry Dresden takes a case that plunges Chicago into dark magic.",
  "the fear - natasha preston": "A teen is targeted by a stalker and must uncover who is behind the threats.",
  "super powereds - drew hayes": "Students at a secret college train to become superheroes amid rivalry and danger.",
  "great big beautiful life - emily henry": "A tender romance about two people rebuilding their lives and learning to choose happiness.",
  "world war z - max brooks": "An oral history of a global zombie war told through survivors’ testimonies.",
  "the spear cuts through water - simon jimenez": "An epic fantasy journey told through layered storytelling and mythic trials.",
  "ready player one - ernest cline": "A gamer hunts for a fortune in a virtual reality world ruled by puzzles and nostalgia.",
  "the billionaire alpha kings lost omega - ruby yuri": "A paranormal romance about a powerful alpha searching for his missing mate.",
  "bunny - mona ayad": "A lonely MFA student is drawn into a surreal and sinister clique called the Bunnies.",
  "the dream hotel - laila lalami": "A woman trapped in a predictive‑policing program fights to reclaim her autonomy."
}
